In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import re

In [2]:
df_sports = pd.read_csv('Laliga.csv', sep=',',header=1)

In [3]:
df_sports.shape

(61, 20)

In [4]:
df_sports.head(10)

,Pos,Team,Seasons,Points,GamesPlayed,GamesWon,GamesDrawn,GamesLost,GoalsFor,GoalsAgainst,Champion,Runner-up,Third,Fourth,Fifth,Sixth,T,Debut,Since/LastApp,BestPosition
0,1,Real Madrid,86,4385,2762,1647,552,563,5947,3140,33,23,8,8,3,4,79,1929,1929,1
1,2,Barcelona,86,4262,2762,1581,573,608,5900,3114,25,25,12,12,4,6,83,1929,1929,1
2,3,Atletico Madrid,80,3442,2614,1241,598,775,4534,3309,10,8,16,9,7,6,56,1929,2002-03,1
3,4,Valencia,82,3386,2664,1187,616,861,4398,3469,6,6,10,11,10,7,50,1931-32,1987-88,1
4,5,Athletic Bilbao,86,3368,2762,1209,633,920,4631,3700,8,7,10,5,8,10,49,1929,1929,1
5,6,Sevilla,73,2819,2408,990,531,887,3680,3373,1,4,4,5,12,6,32,1934-35,2001-02,1
6,7,Espanyol,82,2792,2626,948,608,1070,3609,3889,-,-,4,5,2,5,16,1929,1994-95,3
7,8,Real Sociedad,70,2573,2302,864,577,861,3228,3230,2,3,2,5,4,3,19,1929,2010-11,1
8,9,Zaragoza,58,2109,1986,698,522,766,2683,2847,-,1,4,5,4,4,18,1939-40,2012-13,2
9,10,Real Betis,51,1884,1728,606,440,682,2159,2492,1,-,2,3,4,4,14,1932-33,2015-16,1

In [5]:
df_sports.describe()

             Pos    Seasons  BestPosition
count  61.000000  61.000000     61.000000
mean   31.000000  24.000000      7.081967
std    17.752934  26.827225      5.276663
min     1.000000   1.000000      1.000000
25%    16.000000   4.000000      3.000000
50%    31.000000  12.000000      6.000000
75%    46.000000  38.000000     10.000000
max    61.000000  86.000000     20.000000

In [6]:
df_sports.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 20 columns):
Pos              61 non-null int64
Team             61 non-null object
Seasons          61 non-null int64
Points           61 non-null object
GamesPlayed      61 non-null object
GamesWon         61 non-null object
GamesDrawn       61 non-null object
GamesLost        61 non-null object
GoalsFor         61 non-null object
GoalsAgainst     61 non-null object
Champion         61 non-null object
Runner-up        61 non-null object
Third            61 non-null object
Fourth           61 non-null object
Fifth            61 non-null object
Sixth            61 non-null object
T                61 non-null object
Debut            61 non-null object
Since/LastApp    61 non-null object
BestPosition     61 non-null int64
dtypes: int64(3), object(17)
memory usage: 9.6+ KB

In [7]:
# Remove this block ... No use because of this
'''for col in [col for col in df_sports.columns if df_sports[col].dtype == 'object']:
    print(col)
    df_sports[col].replace('-',0)'''

"for col in [col for col in df_sports.columns if df_sports[col].dtype == 'object']:\n    print(col)\n    df_sports[col].replace('-',0)"

In [9]:
#1 - Replacing all - with 0
df_sports.replace(to_replace='-',value=0,inplace=True)
df_sports.head(10)

,Pos,Team,Seasons,Points,GamesPlayed,GamesWon,GamesDrawn,GamesLost,GoalsFor,GoalsAgainst,Champion,Runner-up,Third,Fourth,Fifth,Sixth,T,Debut,Since/LastApp,BestPosition
0,1,Real Madrid,86,4385,2762,1647,552,563,5947,3140,33,23,8,8,3,4,79,1929,1929,1
1,2,Barcelona,86,4262,2762,1581,573,608,5900,3114,25,25,12,12,4,6,83,1929,1929,1
2,3,Atletico Madrid,80,3442,2614,1241,598,775,4534,3309,10,8,16,9,7,6,56,1929,2002-03,1
3,4,Valencia,82,3386,2664,1187,616,861,4398,3469,6,6,10,11,10,7,50,1931-32,1987-88,1
4,5,Athletic Bilbao,86,3368,2762,1209,633,920,4631,3700,8,7,10,5,8,10,49,1929,1929,1
5,6,Sevilla,73,2819,2408,990,531,887,3680,3373,1,4,4,5,12,6,32,1934-35,2001-02,1
6,7,Espanyol,82,2792,2626,948,608,1070,3609,3889,0,0,4,5,2,5,16,1929,1994-95,3
7,8,Real Sociedad,70,2573,2302,864,577,861,3228,3230,2,3,2,5,4,3,19,1929,2010-11,1
8,9,Zaragoza,58,2109,1986,698,522,766,2683,2847,0,1,4,5,4,4,18,1939-40,2012-13,2
9,10,Real Betis,51,1884,1728,606,440,682,2159,2492,1,0,2,3,4,4,14,1932-33,2015-16,1

In [10]:
df_sports['Points'] = pd.to_numeric(df_sports['Points'])
df_sports['Debut'] = df_sports['Debut'].map(lambda x: re.split('-',x)[0])
df_sports['Debut'] = pd.to_numeric(df_sports['Debut'])
df_sports['GamesWon'] = pd.to_numeric(df_sports['GamesWon'])
df_sports['GamesPlayed'] = pd.to_numeric(df_sports['GamesPlayed'])
df_sports['GoalsFor'] = pd.to_numeric(df_sports['GoalsFor'])
df_sports['GoalsAgainst'] = pd.to_numeric(df_sports['GoalsAgainst'])

In [26]:
#2 Teams that had the DEBUT between 1930 ansd 1980
debut_series = df_sports[['Team','Debut']][df_sports.Debut.between(1930,1980, inclusive=True)]
print('Number of teams that had the debut between 1930 and 1980 : ',debut_series['Team'].count())
print("Team names and Debut years are:")
debut_series

Number of teams that had the debut between 1930 and 1980 :  37
Team names and Debut years are:

                   Team  Debut
3              Valencia   1931
5               Sevilla   1934
8              Zaragoza   1939
9            Real Betis   1932
10  Deportivo La Coruna   1941
11           Celta Vigo   1939
12           Valladolid   1948
14       Sporting Gijon   1944
15              Osasuna   1935
16               Malaga   1949
17               Oviedo   1933
18             Mallorca   1960
19           Las Palmas   1951
21              Granada   1941
22       Rayo Vallecano   1977
23                Elche   1959
25             Hercules   1935
26             Tenerife   1961
27               Murcia   1940
28               Alaves   1930
29              Levante   1963
30            Salamanca   1974
31             Sabadell   1943
32                Cadiz   1977
34            Castellon   1941
37              Cordoba   1962
39           Recreativo   1978
40            Burgos CF   1971
41           Pontevedra   1963
46            Gimnastic   1947
49             Alcoyano   1945
50                 Jaen   1953
52           AD Almeria   1979
54               Lleida   1950
57               Condal   1956
58      Atletico Tetuan   1951
59     Cultural Leonesa   1955

In [75]:
#3 Teams which came Top 5 in terms of points
print("Top 5 teams by Points : ")
df_sports[['Team','Points']].sort_values(by='Points', ascending=False).head(5)

Top 5 teams by Points :

              Team  Points
0      Real Madrid    4385
1        Barcelona    4262
2  Atletico Madrid    3442
3         Valencia    3386
4  Athletic Bilbao    3368

In [77]:
def goal_diff_count(df):
    goal_diff = df.GoalsFor - df.GoalsAgainst
    df['Goal_diff_count'] = goal_diff

In [78]:
#4 Finding the goal difference and the team with MAX and MIN goal difference
goal_diff_count(df_sports)
print('Team with MAX goal difference : ', df_sports[['Team']][df_sports.Goal_diff_count == df_sports.Goal_diff_count.max()].iloc[0,0])
print('Team with MIN goal difference : ', df_sports[['Team']][df_sports.Goal_diff_count == df_sports.Goal_diff_count.min()].iloc[0,0])

Team with MAX goal difference :  Real Madrid
Team with MIN goal difference :  Racing Santander

In [35]:
obj_columns = [col for col in df_sports.columns if df_sports[col].dtype == 'object']
obj_columns

['Team',
 'GamesDrawn',
 'GamesLost',
 'Champion',
 'Runner-up',
 'Third',
 'Fourth',
 'Fifth',
 'Sixth',
 'T',
 'Since/LastApp']

In [36]:
def handle_data(cols):
    for col in cols:
        print(col)
        df_sports[col] = df_sports[col].map(lambda x : re.split('-', x)[0])

In [90]:
#5 Adding a new column to calculate the WINNING PERCENTAGE for each of the teams
df_sports['Winning Percent'] = (df_sports.GamesWon/df_sports.GamesPlayed) * 100
df_sports.isna().any()

Pos                False
Team               False
Seasons            False
Points             False
GamesPlayed        False
GamesWon           False
GamesDrawn         False
GamesLost          False
GoalsFor           False
GoalsAgainst       False
Champion           False
Runner-up          False
Third              False
Fourth             False
Fifth              False
Sixth              False
T                  False
Debut              False
Since/LastApp      False
BestPosition       False
Winning Percent     True
GoalsDiff          False
Goal_diff_count    False
dtype: bool

In [91]:
df_sports['Winning Percent'].fillna(0,inplace=True)
df_sports.isna().any()

Pos                False
Team               False
Seasons            False
Points             False
GamesPlayed        False
GamesWon           False
GamesDrawn         False
GamesLost          False
GoalsFor           False
GoalsAgainst       False
Champion           False
Runner-up          False
Third              False
Fourth             False
Fifth              False
Sixth              False
T                  False
Debut              False
Since/LastApp      False
BestPosition       False
Winning Percent    False
GoalsDiff          False
Goal_diff_count    False
dtype: bool

In [92]:
print("Top 5 teams by Winning Percentage : ")
df_sports[['Team','Winning Percent']].sort_values(by='Winning Percent', ascending=False).head(5)

Top 5 teams by Winning Percentage :

              Team  Winning Percent
0      Real Madrid        59.630702
1        Barcelona        57.241130
2  Atletico Madrid        47.475134
3         Valencia        44.557057
4  Athletic Bilbao        43.772629

In [93]:
#6 Teams grouped based on their BESTPOSITION
df_group = df_sports.groupby(by='BestPosition', as_index=False)
df_group.sum()[['BestPosition', 'Points']]

    BestPosition  Points
0              1   27933
1              2    6904
2              3    5221
3              4    6563
4              5    1884
5              6    2113
6              7    1186
7              8    1134
8              9      96
9             10     450
10            11     445
11            12     511
12            14      71
13            15      14
14            16      81
15            17     266
16            19      81
17            20      34